#include <stdio.h>

int main()

{
	int ix;

	printf("请入你要算的矩阵阶数：（只支持2~4阶!)\n");

	scanf("%d",&ix);

	if(ix<2||ix>4)

		printf("你输入的不再可计算范围内!");

	else if(ix==2)

	{
		int b11,b12,b21,b22,B11,B12,B21,B22,BB;

		printf("请按顺序输入二阶矩阵,每个元的值\n");

		scanf("%d %d %d %d",&b11,&b12,&b21,&b22);

		BB = b11*b22 - b12*b21;

		B11 = b22;	B12 = -b12;

		B21 = -b21;	 B22 = b11;

		printf("A* = \n%4d%4d\n%4d%4d\n\n",B11,B12,B21,B22);

		printf("det A = %d\n\n",BB);

		printf("逆矩阵为  A*/det A\n\n");

	}

	else if(ix==3)

	{
		int a11,a12,a13,a21,a22,a23,a31,a32,a33,A11,A12,A13,A21,A22,A23,A31,A32,A33,AA;

		printf("请按顺序输入三阶矩阵，每个元的值\n");

		scanf("%d %d %d %d %d %d %d %d %d",&a11,&a12,&a13,&a21,&a22,&a23,&a31,&a32,&a33);
	
		AA = a11*a22*a33 + a12*a23*a31 + a21*a32*a13 - a13*a22*a31 - a23*a32*a11 -  a12*a21*a33;
	
		A11 = a22*a33 - a23*a32;	A12 = -(a21*a33 - a23*a31);	A13 = a21*a32 - a22*a31;

		A21 = -(a12*a33 - a13*a32);	A22 = a11*a33 - a13*a31;	A23 = -(a11*a32 - a12*a31);

		A31 = a12*a23 - a13*a22;	A32 = -(a11*a23 - a13*a21);	A33 = a11*a22 - a12*a21;

//printf("%3d%3d%3d\n%3d%3d%3d\n%3d%3d%3d\n",A11/AA,A21/AA,A31/AA,A12/AA,A22/AA,A23/AA,A13/AA,A32/AA,A33/AA);不知道怎么表示分数，只能分开写了，知道分数的表示方法后，此句可以启用！
	
		printf("A* = \n%4d%4d%4d\n%4d%4d%4d\n%4d%4d%4d\n\n",A11,A21,A31,A12,A22,A32,A13,A23,A33);
	
		printf("det A = %d\n\n",AA);

		printf("逆矩阵为A*/det A\n\n");

	}

	else if(ix==4)

	{

		int c11,c12,c13,c14,c21,c22,c23,c24,c31,c32,c33,c34,c41,c42,c43,c44,C11,C12,C13,C14,C21,C22,C23,C24,C31,C32,C33,C34,C41,C42,C43,C44,CC;

		printf("请按顺序输入四阶矩阵，每个元的值\n");

		scanf("%d %d %d %d %d %d %d %d %d %d %d %d %d %d %d %d",&c11,&c12,&c13,&c14,&c21,&c22,&c23,&c24,&c31,&c32,&c33,&c34,&c41,&c42,&c43,&c44);

		CC = c11*(c22*c33*c44 + c23*c34*c42 + c32*c43*c24 - c24*c33*c42 - c23*c32*c44 - c34*c43*c22) + c12*(c24*c33*c41 + c23*c31*c44 + c34*c43*c21 - c21*c33*c44 - c23*c34*c41 - c31*c43*c24) + c13*(c21*c32*c44 + c22*c34*c41 + c31*c42*c24 - c41*c32*c24 - c22*c31*c44 - c34*c42*c21) - c14*(c21*c32*c43 + c22*c33*c41 + c31*c42*c32 - c23*c32*c41 - c22*c31*c43 - c33*c42*c21);

		C11 = c22*c33*c44 + c23*c34*c42 + c32*c43*c24 - c24*c33*c42 - c23*c32*c44 - c34*c43*c22;

		C12 = -(c21*c33*c44 + c23*c34*c41 + c31*c43*c24 - c24*c33*c41 - c23*c31*c44 - c34*c43*c21);

		C13 = c21*c32*c44 + c22*c34*c41 + c31*c42*c24 - c41*c32*c24 - c22*c31*c44 - c34*c42*c21;

		C14 = -(c21*c32*c43 + c22*c33*c41 + c31*c42*c32 - c23*c32*c41 - c22*c31*c43 - c33*c42*c21);

		C21 = -(c12*c33*c44 + c13*c34*c42 + c32*c43*c14 - c14*c33*c42 - c34*c43*c12 - c13*c32*c44);

		C22 = c11*c33*c44 + c13*c34*c41 + c31*c43*c14 - c14*c33*c41 - c34*c43*c11 - c44*c13*c31;

		C23 = -(c11*c32*c44 + c12*c34*c41 + c31*c42*c14 - c14*c32*c41 - c34*c42*c11 - c44*c21*c31);

		C24 = c11*c32*c43 + c12*c33*c41 + c31*c42*c13 - c13*c32*c41 - c31*c12*c43 - c33*c42*c11;

		C31 = c12*c23*c44 + c13*c24*c42 + c22*c43*c14 - c14*c23*c42 - c24*c43*c12 - c44*c13*c22;

		C32 = -(c11*c23*c44 + c13*c24*c41 + c21*c43*c14 - c14*c23*c41 - c24*c43*c11 - c44*c13*c21);

		C33 = c11*c22*c44 + c12*c24*c41 + c21*c42*c14 - c14*c22*c41 - c24*c42*c11 - c12*c21*c44;

		C34 = -(c11*c22*c43 + c12*c23*c41 + c21*c42*c13 - c13*c22*c41 - c23*c42*c11 - c12*c21*c43);

		C41 = -(c12*c23*c34 + c13*c24*c32 + c22*c33*c44 - c14*c23*c32 - c24*c33*c12 - c13*c22*c34);

		C42 = c11*c23*c34 + c13*c24*c31 + c21*c33*c14 - c14*c23*c31 - c24*c33*c11 - c13*c21*c34;

		C43 = -(c11*c22*c34 + c12*c24*c31 + c21*c32*c14 - c14*c22*c31 - c24*c32*c11 - c12*c21*c34);
		
		C44 = c11*c22*c33 + c12*c23*c31 + c21*c32*c13 - c13*c22*c31 - c23*c32*c11 - c12*c21*c33;

		printf("A* = \n%4d%4d%4d%4d\n%4d%4d%4d%4d\n%4d%4d%4d%4d\n%4d%4d%4d%4d\n",C11,C21,C31,C41,C12,C22,C32,C42,C13,C23,C33,C43,C14,C24,C34,C44);

		printf("det A = %d\n\n",CC);

		printf("逆矩阵为  A*/det A\n\n");

	}

	return 0;

}
